ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         <user0_config_app_task.c>
* @author       ADI
* @version      V1.0.0
* @date         13-July-2021
* @brief        Source file contains functions user0_config_app application
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  \copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2021 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/
#ifdef USER0_CONFIG_APP
/*---------------------------- Includes --------------------------------------*/
#include "user0_config_app_task.h"
#include "display_app.h"
#include "low_touch_task.h"
#include "system_task.h"
#include "ble_task.h"
#include "app_timer.h"
#include "power_manager.h"
#include <common_application_interface.h>
#include <user0_config_application_interface.h>
#include <post_office.h>
#include <system_task.h>
#ifdef DCB
#include "adi_dcb_config.h"
#include "dcb_user0_block.h"
#include "dcb_general_block.h"
#include "lcd_driver.h"
#include <dcb_interface.h>
#endif
/* Low touch App Module Log settings */
#define NRF_LOG_MODULE_NAME user0_config_app

#if USER0_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL USER0_CONFIG_LOG_LEVEL
#endif
#define NRF_LOG_INFO_COLOR USER0_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR USER0_CONFIG_DEBUG_COLOR
#else // USER0_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL 0
#endif // USER0_CONFIG_LOG_ENABLED

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

/* For user0_config_app FreeRTOS Task Creation */
ADI_OSAL_STATIC_THREAD_ATTR g_user0_config_app_attributes;
uint8_t ga_user0_config_app_stack[APP_OS_CFG_USER0_CONFIG_APP_TASK_STK_SIZE];
StaticTask_t g_user0_config_app_tcb;
ADI_OSAL_THREAD_HANDLE gh_user0_config_app_handler;
ADI_OSAL_QUEUE_HANDLE gh_user0_config_app_msg_queue = NULL;
/* semaphore handler for user0_config_app task */
ADI_OSAL_SEM_HANDLE   user0_config_app_evt_sem;

/* Handler for repeated timer for USER0 config ON. */
APP_TIMER_DEF(m_user0_config_app_on_timer_id);

/* Flag which gets set, when either ON/OFF timer expires. Its based on this flag
 * and the event detected, that the user0 config app state changes */
volatile uint8_t gUser0ConfigAppTimerUp = 0;


/* Variable which holds the status of user0 config init/deinitialisation */
static uint8_t gnUser0ConfigInitFlag = 0;

#ifdef CUST4_SM
#include "usbd_task.h"
/**
* Variable to hold the current state of the state machine
* Changes to make sure that the variable is not cleared to zero after Watch reset
*/
volatile USER0_CONFIG_APP_STATE_t gnUser0ConfigAppState __attribute__((section(".non_init")));

/**
* Varibale to hold the previous state and previous event registered in the firmware
* Changes to make sure that the variable is not cleared to zero after Watch reset
*/
#define PREV_ST_EVT_BUFF_CNT 0x4

volatile user0_app_prev_state_event_t gUser0AppPrevStateEventTs[PREV_ST_EVT_BUFF_CNT] __attribute__((section(".non_init")));
volatile uint8_t prev_st_evt_buff_ind __attribute__((section(".non_init")));

//Debug variable to count no: of times intermittent logging is done
volatile uint16_t gn_intermittent_op_count __attribute__((section(".non_init")));

extern volatile bool gnGpioPowerOn;
extern volatile bool gnWatchReset;
#endif

/*
* Variable to bypass user0 app timings, to force continuous mode of operations from sensors
* Will be useful, when there is user0 timings meant for intermittent opearation in LT Mode3
*/
volatile uint8_t gn_bypass_user0_timings = 0;

static uint16_t user_applied_agc_up_th;
static uint16_t user_applied_agc_low_th;
static uint16_t user_applied_adv_timeout_monitor;
static uint16_t user_applied_hw_id;
static uint16_t user_applied_exp_id;
static uint16_t user_applied_adxl_start_time;
static uint16_t user_applied_adxl_tON;
static uint16_t user_applied_adxl_tOFF;
static uint16_t user_applied_temp_start_time;
static uint16_t user_applied_temp_tON;
static uint16_t user_applied_temp_tOFF;
static uint16_t user_applied_adpd_start_time;
static uint16_t user_applied_adpd_tON;
static uint16_t user_applied_adpd_tOFF;
static uint16_t user_applied_eda_start_time;
static uint16_t user_applied_eda_tON;
static uint16_t user_applied_eda_tOFF;
static uint16_t user_applied_sleep_min;
static uint16_t user_applied_signal_threshold;
static uint8_t battery_low_event_cnt = 0;
static uint8_t battery_critical_event_cnt = 0;
static uint8_t battery_full_event_cnt = 0;

user0_config_app_lcfg_type_t user0_config_app_lcfg;
/*-------------------- Private Function Declarations ------------------------*/
#ifdef CUST4_SM
static void on_timer_init();
static void user0_config_app_on_timer_start(void);
static void user0_config_app_on_timer_stop(void);
static m2m2_hdr_t *user0_battery_level_alert_handler(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *user0_config_app_get_set_state(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *user0_config_app_get_prev_st_evt_req(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *user0_config_app_clear_prev_st_evt_req(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *user0_config_app_bypass_user0_timings(m2m2_hdr_t *p_pkt);
#endif

static m2m2_hdr_t *user0_config_app_lcfg_access(m2m2_hdr_t *p_pkt);
#ifdef DCB
static m2m2_hdr_t *user0_blk_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *user0_blk_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *user0_blk_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *id_operation(m2m2_hdr_t *p_pkt);
#endif

static void user0_config_app(void *arg);
static void init_user0_config_app_lcfg();
/*--------------------- Public Funtion Declarations -------------------------*/

