ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (user0_config_app_read_lcfg(p_in_payload->ops[i].field, &reg_data) == USER0_CONFIG_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = reg_data;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
      break;
    case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (user0_config_app_write_lcfg(p_in_payload->ops[i].field,
                p_in_payload->ops[i].value) == USER0_CONFIG_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
      break;
    default:
      /* Something has gone horribly wrong. */
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

#ifdef CUST4_SM
/*!
 ****************************************************************************
 *@brief      m2m2 command to get/set gnUser0ConfigAppState variable in User0
              Config app which decides the state
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t * type pointer
 *****************************************************************************/
static m2m2_hdr_t *user0_config_app_get_set_state(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, user0_config_app_set_state_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, user0_config_app_set_state_t,0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, user0_config_app_set_state_t, p_resp_payload);

    switch (p_in_payload->command) {
    case M2M2_USER0_CONFIG_APP_COMMAND_SET_STATE_REQ:
        set_user0_config_app_state(p_in_payload->state);
        status = M2M2_APP_COMMON_STATUS_OK;

        p_resp_payload->state = p_in_payload->state;
        p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_USER0_CONFIG_APP_COMMAND_SET_STATE_RESP;
      break;
    case M2M2_USER0_CONFIG_APP_COMMAND_GET_STATE_REQ:
        status = M2M2_APP_COMMON_STATUS_OK;

        p_resp_payload->state = get_user0_config_app_state();
        p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_USER0_CONFIG_APP_COMMAND_GET_STATE_RESP;
      break;
    default:
      /* Something has gone horribly wrong. */
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 *@brief      Handles the battery level alert notifications received
 *@param      p_pkt: pointer to the packet structure
 *@return     (m2m2_hdr_t *) NULL
 *****************************************************************************/
static m2m2_hdr_t *user0_battery_level_alert_handler(m2m2_hdr_t *p_pkt)
{
  USER0_CONFIG_APP_STATE_t read_user0_config_app_state;

  if(p_pkt != NULL)
  {
    read_user0_config_app_state = get_user0_config_app_state();
    PYLD_CST(p_pkt, m2m2_pm_sys_cmd_t, p_in_payload);

    switch (p_in_payload->status) {
    case M2M2_PM_SYS_STATUS_BATTERY_LEVEL_FULL:
          NRF_LOG_INFO("User0 config app received Battery Full");
          battery_full_event_cnt++;
          /*if((STATE_SLEEP != read_user0_config_app_state)  &&
                   (STATE_INTERMITTENT_MONITORING != read_user0_config_app_state) &&
                   (STATE_INTERMITTENT_MONITORING_START_LOG != read_user0_config_app_state)&&
                   (STATE_INTERMITTENT_MONITORING_STOP_LOG != read_user0_config_app_state)  )*/
          if((STATE_CHARGING_BATTERY == read_user0_config_app_state))
          {
            //Register the event received
            set_user0_config_app_event(EVENT_BATTERY_FULL);
            set_user0_config_app_state(STATE_ADMIT_STANDBY);
          }
          break;
    case M2M2_PM_SYS_STATUS_BATTERY_LEVEL_CRITICAL:
          NRF_LOG_INFO("User0 config app received Battery Level Critical, \
                        current state:%d", read_user0_config_app_state);
          /* set the flag and increase the count*/
          battery_critical_event_cnt++;
          if((STATE_ADMIT_STANDBY ==
                        read_user0_config_app_state) ||
             (STATE_START_MONITORING ==
                        read_user0_config_app_state) )
          {
            set_user0_config_app_event(EVENT_BATTERY_DRAINED);
            set_user0_config_app_state(STATE_OUT_OF_BATTERY_STATE_BEFORE_START_MONITORING);
          }
          else if( (STATE_SLEEP == read_user0_config_app_state)  ||
                   (STATE_INTERMITTENT_MONITORING == read_user0_config_app_state) ||
                   (STATE_INTERMITTENT_MONITORING_START_LOG == read_user0_config_app_state)||
                   (STATE_INTERMITTENT_MONITORING_STOP_LOG == read_user0_config_app_state)  )
          {
            set_user0_config_app_event(EVENT_BATTERY_DRAINED);
            set_user0_config_app_state(STATE_OUT_OF_BATTERY_STATE_DURING_INTERMITTENT_MONITORING);
          }
          break;
    case M2M2_PM_SYS_STATUS_BATTERY_LEVEL_LOW:
          NRF_LOG_INFO("User0 config app received Battery Level Low");
          /* clear the variables as voltage is above critical level*/
          battery_low_event_cnt++;
          break;
    default:
          return NULL;
    }
  }
  return NULL;
}

/*!
 ****************************************************************************
 * @brief    Returns the current state of user0 config app
 *           This variable gets changed as user0 config app runs
 *           Used by other task like low touch/key detect/ble/filesystem/system
 *           user0 config app task to know the current application state
 * @param    None
 * @retval   USER0_CONFIG_APP_STATE_t type is returned
 *****************************************************************************/
USER0_CONFIG_APP_STATE_t get_user0_config_app_state()
{
  USER0_CONFIG_APP_STATE_t state = gnUser0ConfigAppState;
  return(state);
}

/*!
 ****************************************************************************
 * @brief  Sets the current state of user0 config app
 *         gnUser0ConfigAppState variable gets changed as user0 config app runs
 * @param  state: variable of type USER0_CONFIG_APP_STATE_t, to set
 *                gnUser0ConfigAppState with
 * @retval None
 ******************************************************************************/
void set_user0_config_app_state(USER0_CONFIG_APP_STATE_t state)
{
  if(get_low_touch_trigger_mode3_status())
  {
    //Update page_watch_id contents of Display
    send_private_type_value(DIS_REFRESH_SIGNAL);
    reset_display_vol_info1();
  }

