ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
  switch(state)
  {
    case STATE_START_MONITORING:
    case STATE_END_MONITORING: {
      //Turn on the backlight of LCD
      lcd_backlight_set(LCD_BACKLIGHT_ON);
      break;
    }
    default: {
      //Turn off the backlight of LCD
      lcd_backlight_set(LCD_BACKLIGHT_OFF);
      break;
    }
  }
  gnUser0ConfigAppState = state;
}

/*!
 ****************************************************************************
 * @brief  Clear the gUser0AppPrevStateEventTs variable maintained by
 *         by user0 config app
 * @param  None
 * @retval None
 ******************************************************************************/
void clear_user0_config_app_event()
{
  //Clear the previous state-event structure
  memset((uint8_t*)&gUser0AppPrevStateEventTs, 0, sizeof(gUser0AppPrevStateEventTs));
  prev_st_evt_buff_ind = 0;
}

/*!
 ****************************************************************************
 * @brief  Sets the event received by user0 config app
 *         gUser0AppPrevStateEventTs variable gets changed as user0 config app runs
 * @param  event: variable of type USER0_CONFIG_APP_EVENT_t, to set
 *                gUser0AppPrevStateEventTs with
 * @retval None
 ******************************************************************************/
void set_user0_config_app_event(USER0_CONFIG_APP_EVENT_t event)
{
  gUser0AppPrevStateEventTs[prev_st_evt_buff_ind].prev_state = get_user0_config_app_state();
  gUser0AppPrevStateEventTs[prev_st_evt_buff_ind].prev_event = event;
  gUser0AppPrevStateEventTs[prev_st_evt_buff_ind].prev_timestamp = get_sensor_time_stamp();
  prev_st_evt_buff_ind++;
  prev_st_evt_buff_ind = prev_st_evt_buff_ind % PREV_ST_EVT_BUFF_CNT;
}

/*!
 ****************************************************************************
 *@brief      m2m2 command to get the previous state and previous event
              registered in the firmware.
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t * type pointer
 *****************************************************************************/
static m2m2_hdr_t *user0_config_app_get_prev_st_evt_req(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, user0_app_prev_state_event_pkt_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, user0_app_prev_state_event_pkt_t,0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, user0_app_prev_state_event_pkt_t, p_resp_payload);

    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_USER0_CONFIG_APP_GET_PREV_ST_EVT_RESP;
    p_resp_payload->status = M2M2_USER0_CONFIG_APP_STATUS_OK;
    memcpy((uint8_t *)&p_resp_payload->prev_st_evt, (uint8_t*)&gUser0AppPrevStateEventTs, sizeof(gUser0AppPrevStateEventTs));
    p_resp_payload->intermittent_op_cnt = gn_intermittent_op_count;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 *@brief      m2m2 command to clear the previous state and previous event
              structure maintained in the firmware.
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t * type pointer
 *****************************************************************************/
static m2m2_hdr_t *user0_config_app_clear_prev_st_evt_req(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, m2m2_user0_config_app_cmd_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, m2m2_user0_config_app_cmd_t,0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, m2m2_user0_config_app_cmd_t, p_resp_payload);

    clear_user0_config_app_event();
    gn_intermittent_op_count = 0;

    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_USER0_CONFIG_APP_CLEAR_PREV_ST_EVT_RESP;
    p_resp_payload->status = M2M2_USER0_CONFIG_APP_STATUS_OK;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief  User0 config App Initialization
 *         gnUser0ConfigAppState variable gets changed as user0 config app runs
 * @param  None
 * @retval 0  --> success 1 --> fail(returned when it has been initialised already)
 ******************************************************************************/
int user0_config_app_init() {
  if (!gnUser0ConfigInitFlag) {
    init_user0_config_app_lcfg();

    gnUser0ConfigInitFlag = 1;

    user0_config_app_on_timer_start();

    /*Wake up the low touch task*/
    adi_osal_SemPost(lt_task_evt_sem);

    return 0;
  }
  return 1;
}

/*!
 ****************************************************************************
 * @brief  User0 config App Deinitialization
 * @param  None
 * @retval 0-->success 1-->fail(returned when it has been deinitialised already)
 ******************************************************************************/
int user0_config_app_deinit() {
  if (gnUser0ConfigInitFlag) {

    gUser0ConfigAppTimerUp = 0;
    gnUser0ConfigInitFlag = 0;

    return 0;
  }
  return 1;
}

/*!
 ****************************************************************************
 * @brief  user0 config app Timer event function,
 *         which is executed from the user0 config app task.
 * @param  None
 * @retval 0-->success
 ******************************************************************************/
int User0ConfigTimerEvent() {
  if (gUser0ConfigAppTimerUp) {
    /*Timer is up; check the new detected state*/
    gUser0ConfigAppTimerUp = 0;

    if (get_user0_config_app_state() != STATE_OUT_OF_BATTERY_STATE_DURING_INTERMITTENT_MONITORING) {
      set_user0_config_app_state(STATE_INTERMITTENT_MONITORING_STOP_LOG);
    }

    user0_config_app_on_timer_stop();
    adi_osal_SemPost(lt_task_evt_sem);  /*Wake up the low touch task*/

