ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
  } // if(gUser0ConfigAppTimerUp)
  return 0;
}

/*!
 ****************************************************************************
 * @brief     Function for handling the low touch Mode 3 on wrist detection
 *            timer time-out.
 * @details   This function will be called each time the ON-wrist detection timer
 *            expires.
 * @param[in] p_context - unused
 * @retval    None
 ******************************************************************************/
static void user0_config_app_on_wrist_timeout_handler(void *p_context) {
  NRF_LOG_INFO("User0 config ON wrist Timer expiry..");
  gUser0ConfigAppTimerUp = 1;
  adi_osal_SemPost(user0_config_app_evt_sem);
}

/*!
 ****************************************************************************
 * @brief     Function for the Timer initialization.
 * @details   Initializes the timer module. This creates and starts application
 *            timer for ON-wrist detection. This is the log duration for Mode3
 * @param[in] None
 * @retval    None
 ******************************************************************************/
static void on_timer_init() {
  ret_code_t err_code;

  // Create timers
  err_code = app_timer_create(
      &m_user0_config_app_on_timer_id, APP_TIMER_MODE_SINGLE_SHOT, user0_config_app_on_wrist_timeout_handler);

  APP_ERROR_CHECK(err_code);

  NRF_LOG_INFO("user0_config_app ON wrist Timer created");
}

/*!
 ****************************************************************************
 * @brief     Function for starting ON-wrist application timer.
 * @details   Timers are run after the scheduler has started.
 * @param[in] None
 * @retval    None
 ******************************************************************************/
static void user0_config_app_on_timer_start(void) {
  uint32_t time = 0;

  /* LT application has to be enabled, for the longest duration of the application
    that needs to be logged. Based on this, on timer needs to be configured for this
     timing */
  if((user0_config_app_lcfg.adxl_tON+user0_config_app_lcfg.adxl_start_time) > time)
    time = (user0_config_app_lcfg.adxl_tON+user0_config_app_lcfg.adxl_start_time);
  if((user0_config_app_lcfg.temp_tON+user0_config_app_lcfg.temp_start_time) > time)
    time = (user0_config_app_lcfg.temp_tON+user0_config_app_lcfg.temp_start_time);
  if((user0_config_app_lcfg.adpd_tON+user0_config_app_lcfg.adpd_start_time) > time)
    time = (user0_config_app_lcfg.adpd_tON+user0_config_app_lcfg.adpd_start_time);
  if((user0_config_app_lcfg.eda_tON+user0_config_app_lcfg.eda_start_time) > time)
    time = (user0_config_app_lcfg.eda_tON+user0_config_app_lcfg.eda_start_time);

  /* To the log duration time from above calculation,
  Give one sec extra, for the logging to complete, 12 sec extra which is the delay in the LT app to start up */
  time += (13);
  time = time*1000;//convert seconds to millisec

  // Start repeated timer
  ret_code_t err_code = app_timer_start(
      m_user0_config_app_on_timer_id, APP_TIMER_TICKS(time), NULL);
  APP_ERROR_CHECK(err_code);
}

/*!
 ****************************************************************************
 * @brief    Function for stopping ON-wrist application timer.
 * @param[in] None
 * @retval    None
 ******************************************************************************/
static void user0_config_app_on_timer_stop(void) {
  // Stop the repeated timer
  ret_code_t err_code = app_timer_stop(m_user0_config_app_on_timer_id);
  APP_ERROR_CHECK(err_code);
}
#endif

/*!
 ****************************************************************************
 *@brief      m2m2 command to enable/disable the bypass of user0 config app
               timings used by the sensor apps.
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t * type pointer
 *****************************************************************************/
static m2m2_hdr_t *user0_config_app_bypass_user0_timings(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  PYLD_CST(p_pkt, user0_app_bypass_user0_timings_pkt_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, user0_app_bypass_user0_timings_pkt_t,0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, user0_app_bypass_user0_timings_pkt_t, p_resp_payload);

    gn_bypass_user0_timings = p_in_payload->enable;

    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_USER0_CONFIG_APP_BYPASS_USER0_TIMINGS_RESP;
    p_resp_payload->status = M2M2_USER0_CONFIG_APP_STATUS_OK;
    p_resp_payload->enable = p_in_payload->enable;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief    User0 Config task init function.
 * @param[in] None
 * @retval    None
 ******************************************************************************/
void user0_config_app_task_init(void) {
  ADI_OSAL_STATUS eOsStatus;

  /* Create User0 Config app thread */
  g_user0_config_app_attributes.pThreadFunc = user0_config_app;
  g_user0_config_app_attributes.nPriority = APP_OS_CFG_USER0_CONFIG_APP_TASK_PRIO;
  g_user0_config_app_attributes.pStackBase = &ga_user0_config_app_stack[0];
  g_user0_config_app_attributes.nStackSize = APP_OS_CFG_USER0_CONFIG_APP_TASK_STK_SIZE;
  g_user0_config_app_attributes.pTaskAttrParam = NULL;
  /* Thread Name should be of max 10 Characters */
  g_user0_config_app_attributes.szThreadName = "Usr0CfgApp";
  g_user0_config_app_attributes.pThreadTcb = &g_user0_config_app_tcb;

  eOsStatus = adi_osal_MsgQueueCreate(&gh_user0_config_app_msg_queue, NULL, 9);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(APP_OS_CFG_USER0_CONFIG_TASK_INDEX, gh_user0_config_app_msg_queue);
  }

  eOsStatus =
      adi_osal_ThreadCreateStatic(&gh_user0_config_app_handler, &g_user0_config_app_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  adi_osal_SemCreate(&user0_config_app_evt_sem, 0);

#ifdef CUST4_SM
  //ON detection Timer creation, for the log duration of LT App Mode3
  on_timer_init();
#endif
}

#ifdef CUST4_SM
void user0_config_app_state_init()
{
  USER0_CONFIG_APP_STATE_t read_user0_config_app_state;
  read_user0_config_app_state = get_user0_config_app_state();
  USBD_CONN_STATUS_t usbd_conn_status = usbd_get_cradle_disconnection_status();

  /* After Watch reset, handle the GPIO triggered Watch power ON OR
    handle the Watch reset with NAV button press condition */
  if( (gnGpioPowerOn == true) || ( gnWatchReset == true ) )
  {
    //Clear the flag
    (gnGpioPowerOn == true) ? (gnGpioPowerOn = false) :
                              (gnWatchReset = false);

    //Register the event received
    USBD_CONN_STATUS_t usbd_conn_status = usbd_get_cradle_disconnection_status();
    if(usbd_conn_status == USBD_CONNECTED)
      set_user0_config_app_event(EVENT_WATCH_ON_CRADLE_NAV_BUTTON_RESET);
    else
      set_user0_config_app_event(EVENT_NAV_BUTTON_RESET);
  }

  /*After Watch reset, find previous state and set current state*/

  if((read_user0_config_app_state == STATE_ADMIT_STANDBY) ||
     (read_user0_config_app_state == STATE_START_MONITORING))
  {
    user0_config_app_enter_state_admit_standby();
  }

  else if(read_user0_config_app_state == STATE_END_MONITORING)
  {
    user0_config_app_enter_state_end_monitoring();
  }

