ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/user0_config_app/user0_config_app_task.c
#ifdef DCB
/**
 * @brief  Function which handles the m2m2 command to do user0_blk_DCB read
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *user0_blk_dcb_command_read_config(m2m2_hdr_t *p_pkt) {
    uint16_t r_size = 0;
    uint32_t dcbdata[MAXUSER0BLKDCBSIZE];
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

    PKT_MALLOC(p_resp_pkt, m2m2_dcb_user0_blk_data_t, 0);

    if(p_resp_pkt != NULL) {
      // Declare a pointer to the response packet payload
      PYLD_CST(p_resp_pkt, m2m2_dcb_user0_blk_data_t, p_resp_payload);

      r_size = (uint16_t)MAXUSER0BLKDCBSIZE;
       if(read_user0_blk_dcb(&dcbdata[0],&r_size) == USER0_BLK_DCB_STATUS_OK)
      {
          for(int i=0; i< r_size; i++){
            p_resp_payload->dcbdata[i] = dcbdata[i];
          }
          p_resp_payload->size = (r_size);
          status = M2M2_DCB_STATUS_OK;
      }
      else
      {
          p_resp_payload->size = 0;
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }

      p_resp_payload->status = status;
      p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
      p_resp_pkt->src = p_pkt->dest;
      p_resp_pkt->dest = p_pkt->src;
    }
    return p_resp_pkt;
}

/**
 * @brief  Function which handles the m2m2 command to do user0_blk_DCB write
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *user0_blk_dcb_command_write_config(m2m2_hdr_t *p_pkt) {
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
    uint32_t dcbdata[MAXUSER0BLKDCBSIZE];

    // Declare a pointer to access the input packet payload
    PYLD_CST(p_pkt, m2m2_dcb_user0_blk_data_t, p_in_payload);
    PKT_MALLOC(p_resp_pkt, m2m2_dcb_user0_blk_data_t, 0);

    if(p_resp_pkt != NULL) {
      // Declare a pointer to the response packet payload
      PYLD_CST(p_resp_pkt, m2m2_dcb_user0_blk_data_t, p_resp_payload);

      for(int i=0; i<p_in_payload->size; i++) {
        dcbdata[i] = p_in_payload->dcbdata[i];
      }
      if(write_user0_blk_dcb(&dcbdata[0],p_in_payload->size) == USER0_BLK_DCB_STATUS_OK)
      {
          user0_blk_set_dcb_present_flag(true);
          user0_config_app_lcfg_set_from_dcb();
          status = M2M2_DCB_STATUS_OK;
      }
      else
      {
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }

      p_resp_payload->status = status;
      p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
      p_resp_payload->size = 0;
      for(uint16_t i=0; i< MAXUSER0BLKDCBSIZE; i++) {
          p_resp_payload->dcbdata[i] = 0;
      }
      p_resp_pkt->src = p_pkt->dest;
      p_resp_pkt->dest = p_pkt->src;
    }
    return p_resp_pkt;
}

/**
 * @brief  Function which handles the m2m2 command to do user0_blk_DCB delete
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *user0_blk_dcb_command_delete_config(m2m2_hdr_t *p_pkt) {
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

    PKT_MALLOC(p_resp_pkt, m2m2_dcb_user0_blk_data_t, 0);

    if(p_resp_pkt != NULL) {
      // Declare a pointer to the response packet payload
      PYLD_CST(p_resp_pkt, m2m2_dcb_user0_blk_data_t, p_resp_payload);

      if(delete_user0_blk_dcb() == USER0_BLK_DCB_STATUS_OK)
      {
          user0_blk_set_dcb_present_flag(false);
          user0_config_app_lcfg_set_fw_default();
          status = M2M2_DCB_STATUS_OK;
      }
      else
      {
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }

      p_resp_payload->status = status;
      p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
      p_resp_payload->size = 0;
      for(uint16_t i=0; i< MAXUSER0BLKDCBSIZE; i++) {
          p_resp_payload->dcbdata[i] = 0;
      }
      p_resp_pkt->src = p_pkt->dest;
      p_resp_pkt->dest = p_pkt->src;
    }
    return p_resp_pkt;

}

/**
 * @brief  Gets the ID number configured in USER0_BLK DCB
 *
 * @param[in]  id_index: Index from the USER0_BLK DCB to be read from
 *             id_num: Pointer to where the id number is to be read to
 *
 * @return     uint8_t value: GET_ID_SUCCESS, 0-> read DCB success
 *                            GET_ID_FAILURE, 1-> read DCB failed
 */
uint8_t get_id_num(USER0_CONFIG_LCFG_t id_index, uint16_t * id_num) {
  uint16_t r_size = 0;
  uint32_t dcbdata[MAXUSER0BLKDCBSIZE];
  uint8_t status = GET_ID_FAILURE;

  r_size = (uint16_t)MAXUSER0BLKDCBSIZE;
  if (read_user0_blk_dcb(&dcbdata[0], &r_size) == USER0_BLK_DCB_STATUS_OK) {
    *id_num = (uint16_t)dcbdata[id_index];
    status = GET_ID_SUCCESS;
  } else {
    *id_num = 0;
    status = GET_ID_FAILURE;
  }

  return status;
}

/**
 * @brief  Gets the ID number configured in USER0_BLK default/modified
 *         Fw lcfg
 *
 * @param[in]  id_num: Pointer to where the id number is to be read to
 *
 * @return     None
 */
void get_id_num_fw_lcfg(uint16_t * id_num) {
  *id_num = user0_config_app_lcfg.exp_id;
}

/**
 * @brief  Sets the ID number configured in USER0_BLK DCB
 *
 * @param[in]  id_index: Index from the USER0_BLK DCB to be written to
 *             id_num: Value to the id_num to in the id_index field in DCB
 *
 * @return     uint8_t value: SET_ID_SUCCESS, 0-> Write DCB success
 *                            SET_ID_FAILURE, 1-> Write DCB failed
 */
uint8_t set_id_num(USER0_CONFIG_LCFG_t id_index, uint16_t id_num) {
  uint16_t r_size = 0;
  uint32_t dcbdata[MAXUSER0BLKDCBSIZE];
  uint8_t status = SET_ID_FAILURE;

  r_size = (uint16_t)MAXUSER0BLKDCBSIZE;
  if (read_user0_blk_dcb(&dcbdata[0], &r_size) == USER0_BLK_DCB_STATUS_OK) {
    dcbdata[id_index] = id_num; //modify only id_num

    if (write_user0_blk_dcb(&dcbdata[0], r_size) == USER0_BLK_DCB_STATUS_OK) {
      user0_config_app_lcfg_set_from_dcb();
      status = SET_ID_SUCCESS;
    } else {
      status = SET_ID_FAILURE;
    }
  }

  return status;
}

/**
 * @brief  Does ID operation-read/write/delete of id information(hw_id/exp_id)
 *         configured in USER0_BLK DCB
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for reading id information(hw_id/exp_id)
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 *                         with id information(hw_id/exp_id)
 */
static m2m2_hdr_t *id_operation(m2m2_hdr_t *p_pkt) {
  M2M2_USER0_CONFIG_APP_STATUS_ENUM_t status = M2M2_USER0_CONFIG_APP_STATUS_ERR_NOT_CHKD;
  USER0_CONFIG_LCFG_t id_index;

